#@ # 
#@ # Running icc2_shell Version V-2023.12 for linux64 -- Nov 23, 2023
#@ # Date:   Tue May  7 05:32:50 2024
#@ # Run by: vlsi@elc-v1111111-lnx
#@ 

start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
copy_block -from_block sar.dlib:placementt.design -to_block CTTSS
current_block CTTSS.design
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
open_block /home/vlsi/Synopsys/project/project_sar/pnr/sar.dlib:CTS.design
win_set_filter -visible -class cell -filter {assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -visible -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -visible -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
open_block /home/vlsi/Synopsys/project/project_sar/pnr/sar.dlib:CTS.design
open_block /home/vlsi/Synopsys/project/project_sar/pnr/sar.dlib:CTS.design
link_block
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/CTS.tcl
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {true}
gui_set_map_option -map {globalCongestionMap} -option {rule_level} -value {hard}
report_congestion -rerun_global_router
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {24.480 24.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {24.475 24.515}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {24.475 24.515}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {24.475 24.515}
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/routing.tcl
create_block routingg
link_block
create_block routingg
win_select_objects -within {{0.000 0.000} {0.000 0.000}} -slct_targets global -slct_targets_operation clear
copy_block -from_block counter.dlib:CTS.design
copy_block -from_block counter.dlib:CTS.design -to_block routingg
set_working_design_stack sar.dlib:CTS.design
source -verbose -echo /home/vlsi/Synopsys/project/project_sar/pnr/scripts/routing.tcl
exit
save_block sar.dlib:CTS
