#@ # 
#@ # Running lm_shell Version V-2023.12 for linux64 -- Nov 23, 2023
#@ # Date:   Mon May  6 07:39:27 2024
#@ # Run by: vlsi@elc-v1111111-lnx
#@ 

start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
create_workspace -flow exploration -technology /eda/synopsys/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/process/astro/tech/astroTechFile.tf ndmTest
set_app_options -list {design.enable_lib_cell_editing {mutable}}
set_app_options -list {lib.workspace.save_design_views {true}}
set_app_options -list {lib.workspace.keep_all_physical_cells {true}}
set_app_options -list {lib.workspace.save_layout_views {true}}
read_db { /eda/synopsys/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
read_lef /eda/synopsys/SAED90nm_EDK_10072017/SAED90_EDK/SAED_EDK90nm/Digital_Standard_cell_Library/lef/saed90nmEditted.lef
change_selection [get_libs {saed90nmEditted}]
change_selection [get_designs -filter {view_name == design} {ANTENNA}]
current_block saed90nmEditted:ANTENNA.design
win_set_filter -visible -class cell -filter {assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -visible -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -visible -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-77}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array assembly_die_margin clock_margin hard_macro_margin hard_margin route_blockage_margin seal_ring_margin soft_margin} -layer {}
win_set_filter -class pseudo_bump -filter {deleted} -layer {}
win_set_filter -class pseudo_tsv -filter {deleted} -layer {}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-77}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.485 1.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.485 1.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.485 1.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {0.485 1.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {0.485 1.480}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {0.490 1.485}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.490 1.495}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.490 1.495}
win_select_objects -within {{0.605 1.365} {0.655 1.610}} -slct_targets global -slct_targets_operation clear
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {0.650 1.380}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {0.650 1.385}
group_libs
exit
exit
process_workspaces  -directory /home/vlsi/Synopsys/project/project_sar/ndm
exit
